import ExpandableCard from "./ExpandableCard";

export default function InterviewSection() {
    return (
        <section id="expert-section" className="section container">
            <h2>ประสบการณ์จากการสัมภาษณ์</h2>
            <div className="interview-grid">
                <ExpandableCard title="SUT มทส">
                    <p>
                        เป็นการสัมภาษณ์ที่สนุกมากแบบว่าจริงๆก็เริ่มรู้แล้วแหละว่าติดแน่ๆ
                        เพราะตอนที่รุ่นพี่เขารวมตัวพาไปขึ้นรถที่คณะคือมีกันอยู่6คนแล้วรับ30คนก็เลยค่อนข้างที่จะมั่นใจอยู่{" "}
                        <span className="highlight">
                            **แต่ก็เข้าใจได้ทำไมคนถึงน้อย**
                        </span>{" "}
                        ตอนเข้าไปรอสัมภาษณ์ก็อยู่คิวท้ายๆจำไม่ได้ว่าคนที่เท่าไหร่
                        ระหว่างนั้นก็ไปเดินดูห้องแลปคณะ
                        พอถึงคิวสัมภาษณ์ก็ได้สัมภาษณ์กับรองคณบดีก็แอบประหม่านิดหน่อยเพราะสัมภาษณ์ครั้งแรกแต่พอสัมภาษณ์จริงก็ค่อนข้างที่จะชิวมากแบบมากกกกกกกกกกกก
                        ก็เลยช่วยลดความกดดันไปได้มากแล้วรองฯก็เป็นคนกันเองมากพูดสนุกด้วย
                        ก็เลยค่อนข้างที่จะดี
                    </p>
                </ExpandableCard>

                <ExpandableCard title="ComSci สจล">
                    <p>
                        เป็นการสัมภาษณ์ที่หดหู่มากๆๆๆๆๆๆๆๆๆๆ
                        เหมือนถูกลากไปโดนตบกลางสี่แยก
                        คือโดนให้เขียนโค้ดลงในกระดาษแล้วคิดโจทย์เอาเองแล้วคำพูดอาจาย์ที่สัมภาษณ์ค่อนข้างรุนแรงอยู่พอสมควร
                        แต่ในแง่ร้ายก็มีแง่ดีอยู่คือการสัมภาษณ์ในครั้งนี้
                        ทำให้ตัวเองรู้ว่าเราพลาดตรงไหนและยังมีจุดที่พัฒนาอยู่อีกหลายจุด
                        แบบโดนคำถามเกี่ยวกับสาขาเกี่ยวกับเนื้อหาที่จะเจอพวก course cerberus
                        ซึ่งไม่ได้เตรียมมาเลยสุดก็โดนยำเละ ถามเกี่ยวกับ CS กับ CE
                        ต่างกันยังไงซึ่งถึงเราจะตอบถูกไปอาจารย์ก็พยายามาจับผิดเราอยู่ดี คือ
                        จริงๆเหมือนอาจารย์จะทดสอบว่าควบคุมอารมณ์ได้มั้ยและมีความมั่นใจในตัวเองมั้ยประมาณนั้น
                        แต่ใดๆคือสัมภาษณ์โหดเอาเรื่องจัด
                    </p>
                </ExpandableCard>

                <ExpandableCard title="AI มข">
                    <p>
                        เป็นการสัมภาษณ์ที่ชิวแปลกๆแบบห๊ะหมดบทสนทนาแล้วจนทำให้รู้สึกกังวลว่าจะติดป่าววะ
                        ซึงในตอนนั้นก็ชวนอาจารย์คุยไปเรื่อยๆพยายามหาเรื่องคุยให้อาจารย์รู้สึกว่าอยากเข้า
                        แต่ตอนสัมภาษณ์ตอนนั้นเจอคำถามที่แหวกแนวมากแบบไม่ได้คิดไว้
                        แต่เป็นคำถามที่ชิวอยู่ถ้าเทียบกับตอนสัมภาษณ์ ComSci สจล.
                        ซึ่งก่อนมาสัมภาษณ์ที่มข.ก็ทำการบ้านเก็บข้อมูลมาอย่างดีเพราะไม่อยากให้เป็นเหมือนตอนที่
                        สจล. อีก
                        ความรู้สึกหลังเสร็จก็รู้สึกกังวลเพราะมันชิวเกินไปแต่ก็มั่นใจอยู่ว่าน่าจะติด
                        ซึ่งตอนสัมภาษณ์แทบไม่ได้คุยเกี่ยวกับผลงาน
                        ส่วนใหญ่พูดคุยเรื่องเกี่ยวกับชีวิตในรั้วมหาลัย ประมาณนี้
                    </p>
                </ExpandableCard>

                <ExpandableCard title="Data Science มช.">
                    <p>
                        สัมภาษณ์Onlineครั้งแรกถ้าไม่นับตอน ม.ต้น เป็นการสัมภาษณ์ที่กดดัน
                        แต่ที่กดดันนี้หมายถึงเวลาเพราะตอนนั้นกำลังจะต้องpresentationโครงงานต่อและระยะเวลาค่อนข้างที่จะไล่เลี่ยกันมากซึ่งก็ลุ้นมากว่าจะถีงคิวตัวเองตอนไหน
                        ระหว่างนั้นอยู่ดีๆก็วาปเข้าห้องสัมภาษณ์แบบงงๆ
                        ก็พยายามแนะนำตัวเองไปอาจารย์ก็ถามถึงงานแข่งที่มช.ก็ไม่ใช่ปัญหาเท่าไหร่เพราะว่าค่อนข้างมั่นใจในงานที่ทำและก่อนออกมาก็คุยเล่นกับอาจารย์นิดหน่อยประมาณ1-2คำถาม
                        <br /><br />
                        <span className="highlight">
                            **ซึ่งปกติตอนสัมภาษณ์ถ้าอาจารย์มีให้ถามชอบถามประมาณ 4-5 คำถาม**{" "}
                        </span>
                        ออกมาจากห้องสัมภาษณ์จับเวลาไว้ได้ประมาณ5นาทีกว่าซึ่งเร็วมากกกกกกกกกก
                        แบบไม่เคยเจอกับตัวแต่ถามว่ามั่นใจมั้ยก็ค่อนข้างที่จะมั่นใจในระดับนึงอยู่
                    </p>
                </ExpandableCard>

                <ExpandableCard title="ComSci จุฬา">
                    <p>
                        เอาหล่ะเชื่อว่าหลายคนน่าจะอยากรู้ว่าสัมภาษณ์จุฬาเป็นยังไงยากมั้ย
                        ขอตอบตรงนี้เลยว่า <span style={{ color: "var(--error)" }}>ชิวมากๆ</span>{" "}
                        เหมือนอาจารย์ที่สัมภาษณ์ถูกบรีฟแล้วว่าไม่ต้องกดดันนักเรียน
                        ซึ่งการที่ไม่มีการกดดันการทำให้ผู้ถูกสัมภาษณ์รู้สึกชิวนี่แหละ
                        น่ากลัวเพราะว่าทำให้เราไม่สามารถรู้ว่าที่สัมภาษณ์ไปมันดีหรือมันแย่
                        ก็อาจจะทำให้เราวิตกกังวลได้
                        คำถามที่อาจารย์ถามมาก็ไม่ได้มีอะไรมากและเตรียมไว้หมดแล้วเพราะมีรุ่นพี่บอกมา
                        โดยจะมีประมาณ 3-5 คำถาม ตอนแรกอาจารย์จะให้แนะนำตัว
                        แล้วหลังจากนั้นอาจารย์ก็ให้เราเล่าถึง1ผลงานที่ภูมิใจ มากที่สุด
                        เราก็เล่าไปบอกที่มาของโครงงาน บอกวิธีการ ผลลัพธ์ และ ผลสรุป
                        หลังจากนั้นอาจารย์ก็จะทดสอบความรู้นิดหน่อยอาจจะมีโจทย์มาให้แล้วให้เราแก้โจทย์นั้น
                        ซึ่งโจทย์ก็จะต่างไปตามแต่ละสาขา ของคณะวิทย์
                        จากนั้นอาจารญ์จะถามว่ามีอะไรจะถามอาจารย์ไหม
                        <br /><br />
                        <span className="highlight">
                            **ถ้าไม่มี อย่าเพิ่งใจเสียว่าทำไมเขาไม่ถาม**
                        </span>{" "}
                        ซึ่งตอนนั้นก็ถามเกี่ยวกับชมรมในมหาลัย
                        ถามเกี่ยวกับเนื้อหาที่เรียนตอนปี3-4 ทำไมมันมีหลายสาย
                        แล้วก็ออกจากห้องสัมภาษณ์ไปเลย
                    </p>
                </ExpandableCard>

                <ExpandableCard title="IT สจล">
                    <p>
                        สัมภาษณ์ครั้งสุดท้ายละ{" "}
                        <span className="highlight">**เพราะมธ.ไม่ได้ไปสอบสัมภาษณ์**</span>{" "}
                        เป็นการสัมภาษณ์ที่ไม่ได้เตรียมตัวอะไรไปเลยเหมือนครั้งก่อนๆ
                        ไม่ได้จะปล่อยชิวไม่อยากเข้านะ คณะนี้เป็นคณะที่อยากเข้ามากๆตั้งเป้าไว้ตั้งแต่ม.4
                        ว่าจะเข้าให้ได้ แต่หลังจากรู้ผลประกาศจากจุฬาก็เริ่มลังเล
                        แล้วสัมภาษณ์ครั้งนี้ไปแบบชิวๆไม่ได้รู้สึกกดดันมากนัก
                        ชิวขนาดที่ว่าไปแค่ตัวเปล่ากับบัตรประชาชน
                        ถึงคนอื่นจะปริ้นพอร์ตมาด้วยแต่คณะไม่ได้บังคับปริ้นอะนะแค่บัตรประชาชนอย่างเดียวพอ
                        ตอนเข้าห้องสัมภาษณ์ไปมีอาจารย์2คน
                        ซึ่งโต๊ะอาจารย์ค่อนข้างไกลจากตัวเรามาก อาจารย์ก็ให้แนะนำตัวแล้วถามถึงผลงาน
                        และทำอะไรในทีม ก็เล่าให้อาจารย์ฟังไป
                        ซึ่งตอนเล่าอาจารย์ก็ทำหน้าสงสัยเกี่ยวกับผลงาน
                        แล้วอาจารย์ก็ถามว่าผลงานที่เล่าอยู่เนี่ย
                        อยู่ในพอร์ตมั้ยทั้งที่ผลงานนี้อยู่หน้าแรกด้วยซ้ำของพอร์ต
                        ก็แอบใจเสียอยู่นิดนึง ส่วนใหญ่อาจารย์ก็ถามเกี่ยวกับผลงาน และ
                        มีการจับเวลาสัมภาษณ์ด้วยเหมือนจะให้เวลาประมาณ 7
                        นาทีแต่สุดท้ายก็เกินเวลาไปหน่อย เป็น 7 นาทีที่เร็วมาก
                        แล้วบรรยากาศค่อนข้างที่จะตึงๆ ไม่ค่อยชิวเท่าไหร่
                        ออกจากห้องสัมภาษณ์มาก็แอบใจเสียอยู่ แต่ก็เชื่อมั่นว่าตัวเองติดทำได้แน่ๆ
                    </p>
                </ExpandableCard>
            </div>
            <style jsx>{`
        .interview-grid {
            display: grid;
            grid-template-columns: repeat(auto-fill, minmax(350px, 1fr));
            gap: var(--spacing-lg);
        }
      `}</style>
        </section>
    );
}
